In [1]:
import numpy as np 
import pandas as pd

In [2]:
dict1={
    "name":['birju','raushan','chandan','sam'],
    "money":[1200,600,700,300],
    "city":['muzaffarpur','darbhanga','darbhanga','patna']
}

In [6]:
info=pd.DataFrame(dict1)

In [9]:
info

      name  money management         city
0    birju              1200  muzaffarpur
1  raushan               600    darbhanga
2  chandan               700    darbhanga
3      sam               300        patna

In [8]:
info.to_csv('birju.csv')

In [11]:
info.to_csv('birju_index_false.csv',index=False)

In [12]:
info.head(2)

      name  money management         city
0    birju              1200  muzaffarpur
1  raushan               600    darbhanga

In [13]:
info.tail(2)

      name  money management       city
2  chandan               700  darbhanga
3      sam               300      patna

In [15]:
info.describe()

       money management
count          4.000000
mean         700.000000
std          374.165739
min          300.000000
25%          525.000000
50%          650.000000
75%          825.000000
max         1200.000000

In [17]:
birju=pd.read_csv('birju.csv')

In [18]:
birju

   Unnamed: 0     name  money management         city
0           0    birju              1200  muzaffarpur
1           1  raushan               600    darbhanga
2           2  chandan               700    darbhanga
3           3      sam               300        patna

In [20]:
birju['money management'][3]=1300

C:\Users\birju\AppData\Local\Temp\ipykernel_18912\2275177900.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  birju['money management'][3]=1300
C:\Users\birju\AppData\Local\Temp\ipykernel_18912\2275177900.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  birju['money management'][3]=1300

In [21]:
birju

   Unnamed: 0     name  money management         city
0           0    birju              1200  muzaffarpur
1           1  raushan               600    darbhanga
2           2  chandan               700    darbhanga
3           3      sam              1300        patna

In [22]:
birju.to_csv('birju.csv')

In [23]:
birju.index=['first','second','third','fourth']

In [24]:
birju

        Unnamed: 0     name  money management         city
first            0    birju              1200  muzaffarpur
second           1  raushan               600    darbhanga
third            2  chandan               700    darbhanga
fourth           3      sam              1300        patna

In [26]:
birju.column=['first','second','third','fourth']

In [27]:
birju

        Unnamed: 0     name  money management         city
first            0    birju              1200  muzaffarpur
second           1  raushan               600    darbhanga
third            2  chandan               700    darbhanga
fourth           3      sam              1300        patna

In [28]:
birju.row=['first','second','third','fourth']

C:\Users\birju\AppData\Local\Temp\ipykernel_18912\3866876451.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  birju.row=['first','second','third','fourth']